MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX695F512H.atdf
      <value-group caption="Broadcast Enable bit" name="ETHRXFC__BCEN">
         <value caption="Enable Broadcast Filtering" name="" value="0x1" />
         <value caption="Disable Broadcast Filtering" name="" value="0x0" />
      </value-group>
      <value-group caption="Multicast Enable bit" name="ETHRXFC__MCEN">
         <value caption="Enable Multicast Filtering" name="" value="0x1" />
         <value caption="Disable Multicast Filtering" name="" value="0x0" />
      </value-group>
      <value-group caption="Not Me Unicast Enable bit" name="ETHRXFC__NOTMEEN">
         <value caption="Enable Not Me Unicast Filtering" name="" value="0x1" />
         <value caption="Disable Not Me Unicast Filtering" name="" value="0x0" />
      </value-group>
      <value-group caption="Unicast Enable bit" name="ETHRXFC__UCEN">
         <value caption="Enable Unicast Filtering" name="" value="0x1" />
         <value caption="Disable Unicast Filtering" name="" value="0x0" />
      </value-group>
      <value-group caption="Runt Enable bit" name="ETHRXFC__RUNTEN">
         <value caption="The received packet must not be a runt packet for the packet to be accepted" name="" value="0x1" />
         <value caption="Disable Runt filtering" name="" value="0x0" />
      </value-group>
      <value-group caption="Runt Error Collection Enable bit" name="ETHRXFC__RUNTERREN">
         <value caption="The received packet must be a runt packet for the packet to be accepted" name="" value="0x1" />
         <value caption="Disable Runt Error Collection filtering" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC OK Enable bit" name="ETHRXFC__CRCOKEN">
         <value caption="The received packet CRC must be valid for the packet to be accepted" name="" value="0x1" />
         <value caption="Disable CRC filtering" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Error Collection Enable bit" name="ETHRXFC__CRCERREN">
         <value caption="The received packet CRC must be invalid for the packet to be accepted" name="" value="0x1" />
         <value caption="Disable CRC Error Collection filtering" name="" value="0x0" />
      </value-group>
      <value-group caption="Pattern Match Mode bits" name="ETHRXFC__PMMODE">
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches) AND (Packet = Magic Packet)(1" name="" value="0x9" />
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches) AND (Hash Table Filter match)(1" name="" value="0x8" />
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches) AND(Destination Address = Broadcast Address)" name="" value="0x7" />
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches) AND (Destination Address = Broadcast Address)" name="" value="0x6" />
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches) AND (Destination Address = Unicast Address)" name="" value="0x5" />
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches) AND (Destination Address = Unicast Address)" name="" value="0x4" />
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches) AND (Destination Address = Station Address)" name="" value="0x3" />
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches) AND(Destination Address = Station Address)" name="" value="0x2" />
         <value caption="Pattern match is successful if (NOTPM = 1 XOR Pattern Match Checksum matches)" name="" value="0x1" />
         <value caption="Pattern Match is disabled; pattern match is always unsuccessful" name="" value="0x0" />
      </value-group>
      <value-group caption="Pattern Match Inversion bit" name="ETHRXFC__NOTPM">
         <value caption="The Pattern Match Checksum must not match for a successful Pattern Match to occur" name="" value="0x1" />
         <value caption="The Pattern Match Checksum must match for a successful Pattern Match to occur" name="" value="0x0" />
      </value-group>
      <value-group caption="Magic Packet Enable bit" name="ETHRXFC__MPEN">
         <value caption="Enable Magic Packet Filtering" name="" value="0x1" />
         <value caption="Disable Magic Packet Filtering" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Hash Table Filtering bit" name="ETHRXFC__HTEN">
         <value caption="Enable Hash Table Filtering" name="" value="0x1" />
         <value caption="Disable Hash Table Filtering" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Overflow Interrupt Enable bit" name="ETHIEN__RXOVFLWIE">
         <value caption="Enable RXOVFLW Interrupt" name="" value="0x1" />
         <value caption="Disable RXOVFLW Interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Not Available Interrupt Enable bit" name="ETHIEN__RXBUFNAIE">
         <value caption="Enable RXBUFNA Interrupt" name="" value="0x1" />
         <value caption="Disable RXBUFNA Interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmitter Abort Interrupt Enable bit" name="ETHIEN__TXABORTIE">
         <value caption="Enable TXABORT Interrupt" name="" value="0x1" />
         <value caption="Disable TXABORT Interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmitter Done Interrupt Enable bit" name="ETHIEN__TXDONEIE">
         <value caption="Enable TXDONE Interrupt" name="" value="0x1" />
         <value caption="Disable TXDONE Interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="RX Activity Interrupt Enable bit" name="ETHIEN__RXACTIE">
         <value caption="Enable RXACT Interrupt" name="" value="0x1" />
         <value caption="Disable RXACT Interrupt" name="" value="0x0" />
      </value-group>
