MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX695F512H.atdf
         <register caption="Interrupt Flag Status Register 0" name="IFS0" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CTIF" />
            <bitfield mask="0x00000002" name="CS0IF" />
            <bitfield mask="0x00000004" name="CS1IF" />
            <bitfield mask="0x00000008" name="INT0IF" />
            <bitfield mask="0x00000010" name="T1IF" />
            <bitfield mask="0x00000020" name="IC1IF" />
            <bitfield mask="0x00000040" name="OC1IF" />
            <bitfield mask="0x00000080" name="INT1IF" />
            <bitfield mask="0x00000100" name="T2IF" />
            <bitfield mask="0x00000200" name="IC2IF" />
            <bitfield mask="0x00000400" name="OC2IF" />
            <bitfield mask="0x00000800" name="INT2IF" />
            <bitfield mask="0x00001000" name="T3IF" />
            <bitfield mask="0x00002000" name="IC3IF" />
            <bitfield mask="0x00004000" name="OC3IF" />
            <bitfield mask="0x00008000" name="INT3IF" />
            <bitfield mask="0x00010000" name="T4IF" />
            <bitfield mask="0x00020000" name="IC4IF" />
            <bitfield mask="0x00040000" name="OC4IF" />
            <bitfield mask="0x00080000" name="INT4IF" />
            <bitfield mask="0x00100000" name="T5IF" />
            <bitfield mask="0x00200000" name="IC5IF" />
            <bitfield mask="0x00400000" name="OC5IF" />
            <bitfield mask="0x00800000" name="SPI1EIF" />
            <bitfield mask="0x01000000" name="SPI1RXIF" />
            <bitfield mask="0x02000000" name="SPI1TXIF" />
            <bitfield mask="0x04000000" name="U1EIF" />
            <bitfield mask="0x08000000" name="U1RXIF" />
            <bitfield mask="0x10000000" name="U1TXIF" />
            <bitfield mask="0x20000000" name="I2C1BIF" />
            <bitfield mask="0x40000000" name="I2C1SIF" />
            <bitfield mask="0x80000000" name="I2C1MIF" />
         </register>
         <register caption="Interrupt Flag Status Register 1" name="IFS1" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNIF" />
            <bitfield mask="0x00000002" name="AD1IF" />
            <bitfield mask="0x00000004" name="PMPIF" />
            <bitfield mask="0x00000008" name="CMP1IF" />
            <bitfield mask="0x00000010" name="CMP2IF" />
            <bitfield mask="0x00000020" name="U3EIF" />
            <bitfield mask="0x00000040" name="U3RXIF" />
            <bitfield mask="0x00000080" name="U3TXIF" />
            <bitfield mask="0x00000100" name="U2EIF" />
            <bitfield mask="0x00000200" name="U2RXIF" />
            <bitfield mask="0x00000400" name="U2TXIF" />
            <bitfield mask="0x00000800" name="I2C2BIF" />
            <bitfield mask="0x00001000" name="I2C2SIF" />
            <bitfield mask="0x00002000" name="I2C2MIF" />
            <bitfield mask="0x00004000" name="FSCMIF" />
            <bitfield mask="0x00008000" name="RTCCIF" />
            <bitfield mask="0x00010000" name="DMA0IF" />
            <bitfield mask="0x00020000" name="DMA1IF" />
            <bitfield mask="0x00040000" name="DMA2IF" />
            <bitfield mask="0x00080000" name="DMA3IF" />
            <bitfield mask="0x00100000" name="DMA4IF" />
            <bitfield mask="0x00200000" name="DMA5IF" />
            <bitfield mask="0x00400000" name="DMA6IF" />
            <bitfield mask="0x00800000" name="DMA7IF" />
            <bitfield mask="0x01000000" name="FCEIF" />
            <bitfield mask="0x02000000" name="USBIF" />
            <bitfield mask="0x04000000" name="CAN1IF" />
            <bitfield mask="0x08000000" name="CAN2IF" />
            <bitfield mask="0x10000000" name="ETHIF" />
            <bitfield mask="0x20000000" name="IC1EIF" />
            <bitfield mask="0x40000000" name="IC2EIF" />
            <bitfield mask="0x80000000" name="IC3EIF" />
         </register>
         <register caption="Interrupt Flag Status Register 2" name="IFS2" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x00000008" name="U4EIF" />
            <bitfield mask="0x00000010" name="U4RXIF" />
            <bitfield mask="0x00000020" name="U4TXIF" />
            <bitfield mask="0x00000040" name="U6EIF" />
            <bitfield mask="0x00000080" name="U6RXIF" />
            <bitfield mask="0x00000100" name="U6TXIF" />
            <bitfield mask="0x00000200" name="U5EIF" />
            <bitfield mask="0x00000400" name="U5RXIF" />
            <bitfield mask="0x00000800" name="U5TXIF" />
         </register>
         <register caption="Interrupt Enable Control Register 0" name="IEC0" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CTIE" />
            <bitfield mask="0x00000002" name="CS0IE" />
            <bitfield mask="0x00000004" name="CS1IE" />
            <bitfield mask="0x00000008" name="INT0IE" />
            <bitfield mask="0x00000010" name="T1IE" />
            <bitfield mask="0x00000020" name="IC1IE" />
            <bitfield mask="0x00000040" name="OC1IE" />
            <bitfield mask="0x00000080" name="INT1IE" />
            <bitfield mask="0x00000100" name="T2IE" />
            <bitfield mask="0x00000200" name="IC2IE" />
            <bitfield mask="0x00000400" name="OC2IE" />
            <bitfield mask="0x00000800" name="INT2IE" />
            <bitfield mask="0x00001000" name="T3IE" />
            <bitfield mask="0x00002000" name="IC3IE" />
            <bitfield mask="0x00004000" name="OC3IE" />
            <bitfield mask="0x00008000" name="INT3IE" />
            <bitfield mask="0x00010000" name="T4IE" />
            <bitfield mask="0x00020000" name="IC4IE" />
            <bitfield mask="0x00040000" name="OC4IE" />
            <bitfield mask="0x00080000" name="INT4IE" />
            <bitfield mask="0x00100000" name="T5IE" />
            <bitfield mask="0x00200000" name="IC5IE" />
            <bitfield mask="0x00400000" name="OC5IE" />
            <bitfield mask="0x00800000" name="SPI1EIE" />
            <bitfield mask="0x01000000" name="SPI1RXIE" />
            <bitfield mask="0x02000000" name="SPI1TXIE" />
            <bitfield mask="0x04000000" name="U1EIE" />
            <bitfield mask="0x08000000" name="U1RXIE" />
            <bitfield mask="0x10000000" name="U1TXIE" />
            <bitfield mask="0x20000000" name="I2C1BIE" />
            <bitfield mask="0x40000000" name="I2C1SIE" />
            <bitfield mask="0x80000000" name="I2C1MIE" />
         </register>
